In [1]:
import pandas as pd

In [37]:
#1. Select the first value from the Points column of dataset, assigning it to variable first_point.

In [2]:
df=pd.read_csv("C:\\Users\\ASUS\\Desktop\\Matchine learning\\Data sets\\Teams.csv")
df

    Points  Rank    Team  Years
0      876     1  Riders   2014
1      789     2  Riders   2015
2      863     2  Devils   2014
3      673     3  Devils   2015
4      741     3   Kings   2014
5      812     4   Kings   2015
6      756     1   Kings   2016
7      788     1   Kings   2017
8      694     2  Riders   2016
9      701     4  Royals   2014
10     804     1  Royals   2015
11     690     2  Riders   2017

In [40]:
a=df.Points
a

0     876
1     789
2     863
3     673
4     741
5     812
6     756
7     788
8     694
9     701
10    804
11    690
Name: Points, dtype: int64

In [41]:
c=df['Points'][0]
c

876

In [17]:
#2. Select the first row of data (the first record)
first_row = df.iloc[0]
first_row

Points       876
Rank           1
Team      Riders
Years       2014
Name: 0, dtype: object

In [42]:
#3. Select the first 10 values from the Year column in dataset
p=df['Years'].head(10)
p

0    2014
1    2015
2    2014
3    2015
4    2014
5    2015
6    2016
7    2017
8    2016
9    2014
Name: Years, dtype: int64

In [20]:
#4. Select the records with index labels 1, 2, 3, 5, and 8, assigning the result to the variable sample_records
record = df.iloc[[1,2,3,5,8]]
record

   Points  Rank    Team  Years
1     789     2  Riders   2015
2     863     2  Devils   2014
3     673     3  Devils   2015
5     812     4   Kings   2015
8     694     2  Riders   2016

In [3]:
#5. Create a variable df containing the Rank, Points, Team columns of the records with the index labels 0, 5, 10.
df1=df.loc[[0,5,10],['Rank','Points','Team']]
df1

    Rank  Points    Team
0      1     876  Riders
5      4     812   Kings
10     1     804  Royals

In [7]:
#6. Create a variable df containing the Team and Rank columns of the last5 records.
df2=df[['Team','Rank']].tail()
df2

      Team  Rank
7    Kings     1
8   Riders     2
9   Royals     4
10  Royals     1
11  Riders     2

In [49]:
#7. Create a variable df containing all even index label
df.iloc[::2]

    Points  Rank    Team  Years
0      876     1  Riders   2014
2      863     2  Devils   2014
4      741     3   Kings   2014
6      756     1   Kings   2016
8      694     2  Riders   2016
10     804     1  Royals   2015

In [51]:
#8. Create a variable df containing all odd index labels
df.iloc[1::2]

    Points  Rank    Team  Years
1      789     2  Riders   2015
3      673     3  Devils   2015
5      812     4   Kings   2015
7      788     1   Kings   2017
9      701     4  Royals   2014
11     690     2  Riders   2017